a = "Множество — еще одна пос­ледова­тель­ность эле­мен­тов, каж­дый из которых не име­ет сво­его индекса."
b = "То есть эле­мен­ты не упо­рядо­чены и ты не можешь обра­тить­ся к ним по индексу."
print(f"{a} \n{b}")
l = [1, 2, 2, 3, 3, 4, 1]
print(l)
print(f"m = set(l) \nprint(m)")
m = set(l)
print(m)
a = "Ре­зуль­тат: set([1, 2, 3, 4]), то есть пов­торя­ющиеся эле­мен­ты исчезли."
b = "Кста­ти, если хочешь прев­ратить мно­жес­тво (или что‑то дру­гое) в спи­сок, исполь­зуй фун­кцию list()."
print(f"{a} \n{b}")

