pip install requests
pip install html2text

# Модуль requests позволяет делать GET- и POST- запросы к веб-страницам. 
# Модуль html2text служит для преобразования HTML-кода веб - страниц в обычный текст, то есть чистит его от тегов HTML.


# К­ды ответа сервера помог­ют понять, как прошел запрос. 
# Код 200 означает, что сер­вер успешно обра­ботал зап­рос и отдал нам ответ, 
# код 404 — стра­ница не была най­дена, 
# 500 — внут­ренняя ошиб­ка сер­вера, 
# 503 — сер­вер недос­тупен и так далее.
# https://ru.wikipedia.org/wiki/%D0%A1%D0%BF%D0%B8%D1%81%D0%BE%D0%BA_%D0%BA%D0%BE%D0%B4%D0%BE%D0%B2_%D1%81%D0%BE%D1%81%D1%82%D0%BE%D1%8F%D0%BD%D0%B8%D1%8F_HTTP


