# Условия
# Если [что-то] правда:
#     Сделай что-то.
# Перед сделай что-то, четыре пробела или табуляция очень важна.

print("Программа 1 запущенна.")
pogoda = "Зима"
if pogoda == 'Зима':
    print('Сейчас холодная погода, лутше сиди дома.')
print("Программа  1 завершена.")


print("\nПрограмма 2 запущенна.")
pogoda = "Дождь"
if pogoda == 'Зима':
    print('Сейчас холодная погода, лутше сиди дома.')
print("Программа 2 завершена.")


print("\nПрограмма 3 запущенна.")
pogoda = "Дождь"
if pogoda == 'Зима':
    print('Сейчас холодная погода, лутше сиди дома.')
if pogoda == "Дождь":
    print('УУУ ... сейчас на улице дождь, возми зонтик.')
print("Программа 3 завершена.")

print("\nПрограмма 3 запущенна.")
pogoda = "Дождь"
if pogoda == 'Зима':
    print('Сейчас холодная погода, лутше сиди дома.')
if pogoda == "Дождь":
    print('УУУ ... сейчас на улице дождь, возми зонтик.')
print("Программа 3 завершена.")

print("\nПрограмма 4 запущенна.")
pogoda = "Солнце"
if pogoda == 'Зима':
    print('Сейчас холодная погода, лутше сиди дома.')
if pogoda == "Дождь":
    print('УУУ ... сейчас на улице дождь, возми зонтик.')
if pogoda == "Солнце":
    print('О... сейчас на улице солнце, иди погуляй.')
print("Программа 4 завершена.")


print("\nПрограмма 5 запущенна.")
pogoda = "Зима"
time = "Ночь"
if pogoda == 'Зима':
    print('Сейчас холодная погода, лутше сиди дома.')
    if time == "Ночь":
        print("На улице темно!")
if pogoda == "Дождь":
    print('УУУ ... сейчас на улице дождь, возми зонтик.')
if pogoda == "Солнце":
    print('О... сейчас на улице солнце, иди погуляй.')
print("Программа 5 завершена.")

print("\nПрограмма 6 запущенна.")
pogoda = "Зима"
time = "День"
if pogoda == 'Зима':
    print('Сейчас холодная погода, лутше сиди дома.')
    if time == "Ночь":
        print("На улице темно!")
    if time == "День":
        print("Сейчас конечно день но холодно как.")
if pogoda == "Дождь":
    print('УУУ ... сейчас на улице дождь, возми зонтик.')
if pogoda == "Солнце":
    print('О... сейчас на улице солнце, иди погуляй.')
print("Программа 6 завершена.")

